In [1]:
import pandas as pd
import numpy as np

import acquire
import prepare

#new import
from sklearn.linear_model import LogisticRegression

#### In these exercises, we'll continue working with the titanic dataset and building logistic regression models. Throughout this exercise, be sure you are training, evaluation, and comparing models on the train and validate datasets. The test dataset should only be used for your final model.

#### For all of the models you create, choose a threshold that optimizes for accuracy.

In [2]:
df = acquire.get_titanic_data()

csv file found and loaded

In [3]:
df.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

In [4]:
df.shape

(891, 13)

In [9]:
# df [~df.age.isnull()]

In [10]:
train, validate, test = prepare.prep_titanic_data(df)

In [11]:
train.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embark_town,alone,sex_male,embark_town_Queenstown,embark_town_Southampton
548,548,0,3,male,33.0,1,1,20.525,Southampton,0,1,0,1
133,133,1,2,female,29.0,1,0,26.000,Southampton,0,0,0,1
540,540,1,1,female,36.0,0,2,71.000,Southampton,0,0,0,1
2,2,1,3,female,26.0,0,0,7.925,Southampton,1,0,0,1
649,649,1,3,female,23.0,0,0,7.550,Southampton,1,0,0,1

In [13]:
# train.isnull().sum()

In [14]:
X_train = train.drop(columns=['passenger_id','sex','embark_town', 'survived'])
X_validate = validate.drop(columns=['passenger_id','sex','embark_town', 'survived'])
X_test = test.drop(columns=['passenger_id','sex','embark_town', 'survived'])

In [15]:
X_train.head()

,pclass,age,sibsp,parch,fare,alone,sex_male,embark_town_Queenstown,embark_town_Southampton
548,3,33.0,1,1,20.525,0,1,0,1
133,2,29.0,1,0,26.000,0,0,0,1
540,1,36.0,0,2,71.000,0,0,0,1
2,3,26.0,0,0,7.925,1,0,0,1
649,3,23.0,0,0,7.550,1,0,0,1

In [16]:
target = 'survived'

In [17]:
y_train = train[target]
y_validate = validate[target]
y_test = test[target]

In [18]:
y_train.head()

548    0
133    1
540    1
2      1
649    1
Name: survived, dtype: int64

#### Create a model that includes only age, fare, and pclass. Does this model perform better than your baseline?

In [20]:
y_train.value_counts()

0    254
1    174
Name: survived, dtype: int64

In [22]:
(y_train == 0).mean()

0.5934579439252337

In [24]:
X_train.head()

,pclass,age,sibsp,parch,fare,alone,sex_male,embark_town_Queenstown,embark_town_Southampton
548,3,33.0,1,1,20.525,0,1,0,1
133,2,29.0,1,0,26.000,0,0,0,1
540,1,36.0,0,2,71.000,0,0,0,1
2,3,26.0,0,0,7.925,1,0,0,1
649,3,23.0,0,0,7.550,1,0,0,1

In [44]:
features1 = ['age','fare','pclass']
X_train[features1].head()

      age    fare  pclass
548  33.0  20.525       3
133  29.0  26.000       2
540  36.0  71.000       1
2    26.0   7.925       3
649  23.0   7.550       3

In [23]:
logit = LogisticRegression()

In [28]:
logit.fit(X_train[features1], y_train)

LogisticRegression()

In [30]:
logit.score(X_train[features1], y_train)

0.6985981308411215

#### Include sex in your model as well. Note that you'll need to encode or create a dummy variable of this feature before including it in a model.

In [33]:
X_train.head()

,pclass,age,sibsp,parch,fare,alone,sex_male,embark_town_Queenstown,embark_town_Southampton
548,3,33.0,1,1,20.525,0,1,0,1
133,2,29.0,1,0,26.000,0,0,0,1
540,1,36.0,0,2,71.000,0,0,0,1
2,3,26.0,0,0,7.925,1,0,0,1
649,3,23.0,0,0,7.550,1,0,0,1

In [34]:
features2 = ['age','fare','pclass', 'sex_male']
X_train[features2].head()

      age    fare  pclass  sex_male
548  33.0  20.525       3         1
133  29.0  26.000       2         0
540  36.0  71.000       1         0
2    26.0   7.925       3         0
649  23.0   7.550       3         0

In [35]:
logit2 = LogisticRegression()

In [36]:
logit2.fit(X_train[features2], y_train)

LogisticRegression()

In [38]:
logit2.score(X_train[features2], y_train)

0.7873831775700935

#### Try out other combinations of features and models.

In [40]:
logit3 = LogisticRegression(class_weight='balanced')

In [41]:
logit3.fit(X_train[features2], y_train)

LogisticRegression(class_weight='balanced')

In [42]:
logit3.score(X_train[features2], y_train)

0.7873831775700935

#### Use you best 3 models to predict and evaluate on your validate sample.

In [47]:
logit.score(X_train[features1], y_train)

0.6985981308411215

In [48]:
logit.score(X_validate[features1], y_validate)

0.6923076923076923

In [49]:
logit2.score(X_train[features2], y_train)

0.7873831775700935

In [50]:
logit2.score(X_validate[features2], y_validate)

0.7692307692307693

In [51]:
logit3.score(X_train[features2], y_train)

0.7873831775700935

In [52]:
logit3.score(X_validate[features2], y_validate)

0.7902097902097902

#### Choose you best model from the validation performation, and evaluate it on the test dataset. How do the performance metrics compare to validate? to train?

In [53]:
logit3.score(X_test[features2], y_test)

0.8181818181818182